-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: localhost    Database: food_price
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `foodlist`
--

DROP TABLE IF EXISTS `foodlist`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `foodlist` (
  `foodNum` int NOT NULL AUTO_INCREMENT,
  `foodName` varchar(100) DEFAULT NULL,
  `foodWeight` float DEFAULT NULL,
  `foodPrice` int DEFAULT NULL,
  `foodDate` date DEFAULT NULL,
  `foodCategory` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`foodNum`)
) ENGINE=InnoDB AUTO_INCREMENT=69 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `foodlist`
--

LOCK TABLES `foodlist` WRITE;
/*!40000 ALTER TABLE `foodlist` DISABLE KEYS */;
INSERT INTO `foodlist` VALUES (1,'쌀/일반계',20,46880,'2023-02-10','식량작물'),(2,'찹쌀/일반계',40,98525,'2023-02-10','식량작물'),(3,'콩/흰 콩(국산)',40,216000,'2023-02-10','식량작물'),(4,'팥/붉은 팥(국산)',40,364400,'2023-02-10','식량작물'),(5,'녹두/국산',40,535750,'2023-02-10','식량작물'),(6,'고구마/밤',10,30800,'2023-02-10','식량작물'),(7,'감자/수미',20,46640,'2023-02-10','식량작물'),(8,'감자/대지마',20,51133,'2023-02-10','식량작물'),(9,'배추/월동',10,6522,'2023-02-10','채소류'),(10,'양배추',8,7538,'2023-02-10','채소류'),(11,'시금치',4,14260,'2023-02-10','채소류'),(12,'상추/적',4,22000,'2023-02-10','채소류'),(13,'상추/청',4,19960,'2023-02-10','채소류'),(14,'얼갈이배추',4,9964,'2023-02-10','채소류'),(15,'수박',1,22580,'2023-02-10','채소류'),(16,'오이/가시계통',10,49750,'2023-02-10','채소류'),(17,'오이/다다기계통',100,80375,'2023-02-10','채소류'),(18,'오이/취청',50,43900,'2023-02-10','채소류'),(19,'호박/애호박',20,36440,'2023-02-10','채소류'),(20,'호박/쥬키니',10,44140,'2023-02-10','채소류'),(21,'토마토',5,17960,'2023-02-10','채소류'),(22,'딸기',2,24000,'2023-02-10','채소류'),(23,'무/월동',20,14580,'2023-02-10','채소류'),(24,'당근/무세척',20,59080,'2023-02-10','채소류'),(25,'열무',4,10824,'2023-02-10','채소류'),(26,'건고추/화건',30,626400,'2023-02-10','채소류'),(27,'건고추/양건',30,749200,'2023-02-10','채소류'),(28,'풋고추',10,107800,'2023-02-10','채소류'),(29,'풋고추/꽈리고추',4,36400,'2023-02-10','채소류'),(30,'풋고추/청양고추',10,149800,'2023-02-10','채소류'),(31,'풋고추/오이맛고추',10,96400,'2023-02-10','채소류'),(32,'붉은고추',10,61940,'2023-02-10','채소류'),(33,'피마늘/난지(대서)',10,64520,'2023-02-10','채소류'),(34,'피마늘/난지(남도)',10,83250,'2023-02-10','채소류'),(35,'깐마늘(국산)/깐마늘(남도)',20,173000,'2023-02-10','채소류'),(36,'깐마늘(국산)/깐마늘(대서)',20,161000,'2023-02-10','채소류'),(37,'양파',15,22600,'2023-02-10','채소류'),(38,'파/대파',1,2174,'2023-02-10','채소류'),(39,'파/쪽파',1,5682,'2023-02-10','채소류'),(40,'생강/국산',10,93860,'2023-02-10','채소류'),(41,'미나리',7.5,72200,'2023-02-10','채소류'),(42,'깻잎',2,27040,'2023-02-10','채소류'),(43,'피망/청',10,88840,'2023-02-10','채소류'),(44,'파프리카',5,39240,'2023-02-10','채소류'),(45,'멜론',8,45720,'2023-02-10','채소류'),(46,'방울토마토/대추방울토마토',1,6172,'2023-02-10','채소류'),(47,'참깨/백색(국산)',30,717400,'2023-02-10','특용작물'),(48,'들깨/국산',22.5,304000,'2023-02-10','특용작물'),(49,'땅콩/국산',30,439000,'2023-02-10','특용작물'),(50,'느타리버섯',2,14040,'2023-02-10','특용작물'),(51,'느타리버섯/애느타리버섯',2,7464,'2023-02-10','특용작물'),(52,'팽이버섯',5,13640,'2023-02-10','특용작물'),(53,'새송이버섯',2,8780,'2023-02-10','특용작물'),(54,'사과/후지',10,42480,'2023-02-10','과일류'),(55,'배/신고',15,44680,'2023-02-10','과일류'),(56,'포도/레드글로브 페루',8,51260,'2023-02-10','과일류'),(57,'포도/샤인머스켓',2,16100,'2023-02-10','과일류'),(58,'감귤/노지',5,16260,'2023-02-10','과일류'),(59,'단감',10,32120,'2023-02-10','과일류'),(60,'바나나/수입',13,31200,'2023-02-10','과일류'),(61,'참다래/국산',10,43060,'2023-02-10','과일류'),(62,'파인애플/수입',12,29380,'2023-02-10','과일류'),(63,'오렌지/네이블 미국',18,82440,'2023-02-10','과일류'),(64,'레몬/수입',17,73320,'2023-02-10','과일류'),(65,'체리/수입',5,52240,'2023-02-10','과일류'),(66,'망고/수입',5,51780,'2023-02-10','과일류'),(67,'건미역',1,13460,'2023-02-10','수산물'),(68,'굴',1,13900,'2023-02-10','수산물');
/*!40000 ALTER TABLE `foodlist` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-02-12  0:19:58
